package practice.practiceDice5;
// 일단 주사위게임 3,4로 시작(1:1게임)
// 친구와 게임을 할 수 있습니다.
// 주사위를 3개 굴립니다.
// 첫 번째 주사위가 짝수라면
// 두 번째 주사위와 세 번째 주사위를 굴릴 수 있습니다.
// 두 번째 주사위는 특수 기능이 별도로 존재하지 않습니다.
// 세 번째 주사위는 숫자 1인 경우 친구에게 점수를 3점 뺏을 수 있습니다.
// 숫자가 3인 경우엔 자신에게 2점을 가산합니다.
// 숫자가 4인 경우엔 무조건 패배하게 됩니다.
public class Dice5Main {
    // 일단 주사위 만들자^^
    // 다음으로 주사위 3개 굴리기 - 굴리는건 게임에서!
    // 그리고 주사위 합도 일단 구해주자 - 완료
    // 이제 플레이어 만들어주자
    //
    public static void main(String[] args) {
        Dice5Game dicegame = new Dice5Game();
//        dicegame.playGame();



    }
}
