<!--
vue와 Spring을 활용하는 문제.
Spring에서 주사위를 굴려서 결과를 알려주게 되며 vue에서는 이것을 출력.
-->

<!--
4.작업을 진행하기 위한 Backlog를 작성해보세요.
    1)주사위 굴리는 class 생성 (Spring)
        -1~6사이의 숫자를 랜덤생성
    2)주사위 작동시키는 버튼 만들기 (Vue)
        -버튼을 만들고, 버튼을 누를때마다 숫자값이 출력되도록 제작
    3)주사위 값 출력 방식 결정 (Vue)
        -버튼을 누르면 주사위 랜덤값이 나타나는 창이 나오는 방식
        -버튼을 누르면 주위 빈 공간(옆)에 출력되는 방식
        -controller

    4)기본 페이지 이미지 출력 방식 결정
-->







<!--
5.vue를 활용하여 주사위를 굴릴 수 있는 UI를 만들어봅시다.
6.주사위 굴리기 버튼을 누르면 Spring에 요청을 날려서 주사위 값을 출력해봅시다.
7.vuetify를 사용해서 이미지 갤러리를 만들어봅시다.
8.크로셀 기능을 활용해서 2초마다 바뀌는 메인 배너를 만들어봅시다.
9.Domain Service를 사용하는 이유에 대해 기술하세요.
-->