<!--
    Domain Service를 사용하는 이유에 대해 기술하세요
    
    도메인에 관련된 코드를 작성하다보면 상위 수준에서 관계를 파악하기가
    어려워진다. 그래서 복잡한 도메인을 이해하고 관리하기 쉽게하기 위해, 
    애그리거트(aggregate, 연관된 entity와 값 객체들의 묶음)로 그룹화해서
    조망하는 방법을 사용한다.

    도메인 관련 코드를 작성하면 이 애그리거트로 기능을 다 구현할 수 없거나,
    여러 애그리거트로 로직을 구현하면 어떤 것이 주체인지 알 수 없게된다. 
    애그리거트가 기존에 설정한 범위를 넘어서는 기능을 구현해 코드가 길어지고
    의존성이 높아지게 되는 것이다. 
    
    이런 부자연스러움을 해결하기 위해서 Domain Service를 사용하여
    상태가 없이 로직만 구현한다. 이렇게 Domain Service를 분리하면
    의존성과 관련된 처리를 줄일 수 있고, 코드를 유지보수하기 편해진다.
-->