<template lang="">
    <div>
        <p>
            9. Domain Service를 사용하는 이유에 대해 기술하세요.<br/>

            전구는 스스로 혼자 키거나 끌 수 없다.
            이렇듯이 본인이 본인을 작동할 수 없기 때문에 다른 객체의 도움을 받아야 한다.
            이러한 일환으로 탄생하게 된 개념이 Domain Service이다.

            객체 스스로가 직접 하기에는 표현이 애매해지는 작업들을
            모두 Domain Service로 배치하게 된다.
            이를 통해 우리는 가독성과 유지보수성의 향상을 가져올 수 있다.
        </p>
        <br/>
        <p>
            15. Test를 작성함으로서 얻게 되는 이점에 대해 기술하세요.<br/>

            테스트 코드는 개발자가 작성한 코드를 실행하고
            예상된 결과가 나오는지 확인하는데에 사용된다.

            또한 프론트 엔드가 아직 만들어지지 않았음에도
            백엔드를 작성하는 것에 무리가 없다.

            나중에 회사에 가서 실제 코드에서 작업을 하다가 에러가 발생한 경우,
            이러한 실수는 막대한 비용 손실로 이어진다.

            그러므로 테스트 코드를 통해
            에러가 발생하는지 안하는지 확인하여 비용도 아낄 수 있다 !
        </p>
        <br/>
        <p>
            16. vue에서 vuex를 사용할 때 Module을 사용하게 됨으로서
            얻게되는 이점에 대해 기술해보세요.<br/>

            vuex는 상태가 예측 가능한 방식으로만 변경될 수 있도록 하는 규칙을 사용하여
            응용 프로그램의 모든 구성 요소에 대한 집중 식 저장소 역할을 한다.

            만약 이게 없다면, 컴포넌트 간 데이터를 주고 받기 위해 부모는 자식에게 props의 방식으로,
            자식은 부모에게 Emit event의 방법으로 데이터를 주고 받아야 한다.

            또 형제 컴포넌트 간 데이터를 주고 받으려면 너무 복잡해서
            EventBus를 활용해야 사용할 수 있게 된다. 이러한 문제들을 해결해주는 것이 Vuex이다 !

            데이터를 Store라는 파일을 통해 관리하고 프로젝트 전체에 걸쳐 활용할 수 있게 해주며,
            각 목적에 맞는 항목을 module로 분리할 수 있고,nameSpaced 속성을 true로 설정하여
            각 모듈의 이름을 포함한 Dispatch, Commit, state 조회 등을 수행할 수 있다.
        </p>
    </div>
</template>
<script>
export default {
    
}
</script>
<style lang="">
    
</style>